src/InformationRegisters/Диалоги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Диалоги</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оператор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Начало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтложенДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнициированКлиентом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоследнееСообщениеОтКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнегоСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСообщений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяДоПервогоОтвета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбщееВремяОтветов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальноеВремяОтвета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОтветов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачальногоСообщенияСерии</Name>
					<Comment>Дата первого из входящих сообщений, на которые не ответил оператор</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СценарийЧатБота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииЧатБотов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЭтапа</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеЭтапа</Name>
					<Comment>Заголовок или СообщениеБота</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщение</Name>
					<Comment>Сообщение о коллизии</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗавершенРегламентом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдДиалога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/КонтактыМессенджеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КонтактыМессенджеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбъектИдентификации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Заявки</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдПоследнегоДиалога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерМессенджера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФотоКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оператор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеУчаствоватьВРассылке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоГруппа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/КонтрагентыСведенияДляСписка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КонтрагентыСведенияДляСписка</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПервогоПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнегоПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПриемов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапланированнаяПредварительнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСледующегоПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>95</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресЭП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущаяСделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сделки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущийЭтапСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСделки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоследняяЗадача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.Взаимодействие</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоследняяЗадачаПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СледующаяЗадача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.Взаимодействие</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СледующаяЗадачаПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/АктивныеПользователиМессенджер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АктивныеПользователиМессенджер</Name>
			<Comment>Хранит данные об активности в мессенджере, а также аватары всех сотрудников (например, для отображения в мессенджере и журнале записи)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АватарСотрудника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/ЭтапыСделок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЭтапыСделок</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветЭтапа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/Диалоги/Forms/ДетализацияЧатов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформлениеСделок();
	ИнициализироватьМеханизмФильтрацииДанных();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик команды формы.
//
Процедура ПерейтиВЧат(Команда = Неопределено)
	
	ТекущиеДанные = Элементы.СписокЧатов.ТекущиеДанные;
	
	Если Элементы.СписокЧатов.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Идентификатор = ТекущиеДанные.Идентификатор;
	ВнешняяСистема = ТекущиеДанные.ВнешняяСистема;
	
	ИдСообщения = ПолучитьИдОжидающегоСообщения(Идентификатор, ВнешняяСистема);
	
	ДанныеКанала = Новый Структура;
	ДанныеКанала.Вставить("ИдКлиента"		, Идентификатор);
	ДанныеКанала.Вставить("ИдСообщения"		, ИдСообщения);
	ДанныеКанала.Вставить("ВнешняяСистема"	, ВнешняяСистема);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ДанныеКанала", ДанныеКанала);
	
	ФормаМессенджера = Неопределено;
	
	Окна = ПолучитьОкна();
	
	Для Каждого ОкноКлиентскогоПриложения Из Окна Цикл
		Для Каждого Форма Из ОкноКлиентскогоПриложения.Содержимое Цикл
			Если Форма.ИмяФормы = "Обработка.Мессенджер_Стоматология.Форма.ФормаЧатаНовая" Тогда
				ФормаМессенджера = Форма;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если ФормаМессенджера = Неопределено Тогда
		ОткрытьФорму("Обработка.Мессенджер_Стоматология.Форма.ФормаЧатаНовая", ПараметрыОткрытия);
	Иначе
		Оповестить("ОткрытьДиалог", ПараметрыОткрытия);
		ФормаМессенджера.Активизировать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура, обработчик события "Выбор".
//
Процедура СписокЧатовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если Поле = Элементы.СписокЧатовОбъектИдентификации И ЗначениеЗаполнено(ТекущиеДанные.ОбъектИдентификации) Тогда
		ПоказатьЗначение(, ТекущиеДанные.ОбъектИдентификации);
		
	ИначеЕсли Поле = Элементы.СписокЧатовОператор И ЗначениеЗаполнено(ТекущиеДанные.Оператор) Тогда
		ПоказатьЗначение(, ТекущиеДанные.Оператор);
		
	ИначеЕсли Поле = Элементы.СписокЧатовВнешняяСистема Тогда
		ПоказатьЗначение(, ТекущиеДанные.ВнешняяСистема);
		
	ИначеЕсли Поле = Элементы.СписокЧатовЭтапСделки Тогда
		ПоказатьЗначение(, ТекущиеДанные.Сделка);
		
	Иначе
		ПерейтиВЧат();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура, обработчик события "ПриПолученииДанныхНаСервере".
//
Процедура СписокЧатовПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Для Каждого СтрокаСписка Из Строки Цикл
		
		ДанныеСтроки = СтрокаСписка.Значение.Данные;
		
		ДанныеСтроки.ДлительностьДиалогаПредставление		 = ПолучитьПредставлениеВремениДляСписка(ДанныеСтроки.ДлительностьДиалога);
		ДанныеСтроки.ВремяДоПервогоОтветаПредставление		 = ПолучитьПредставлениеВремениДляСписка(ДанныеСтроки.ВремяДоПервогоОтвета);
		ДанныеСтроки.ОбщееВремяОтветовПредставление			 = ПолучитьПредставлениеВремениДляСписка(ДанныеСтроки.ОбщееВремяОтветов);
		ДанныеСтроки.СреднееВремяОтветаПредставление		 = ПолучитьПредставлениеВремениДляСписка(ДанныеСтроки.СреднееВремяОтвета);
		ДанныеСтроки.МаксимальноеВремяОтветаПредставление	 = ПолучитьПредставлениеВремениДляСписка(ДанныеСтроки.МаксимальноеВремяОтвета);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиМеханизмаФильтрацииДанных

#Область ИнициализацияМеханизмаФильтрацииДанных

&НаСервере
// Процедура - Инициализировать механизм фильтрации данных
//
// Параметры:
//  ПараметрыОтбора	 - 	 - 
//  ОбновитьСписок	 - 	 - 
//
Процедура ИнициализироватьМеханизмФильтрацииДанных(ПараметрыОтбора = Неопределено, ОбновитьСписок = Ложь)
	
	// Обновляем отборы согласно параметров, переданных из другой формы	и уходим	
	Если ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("ОчиститьВсеОтборы") И ПараметрыОтбора.ОчиститьВсеОтборы = Истина Тогда
		ОбновитьЗначенияФильтрацииДанных(ПараметрыОтбора); // Перешли из монитора при уже открытой текущей формы
		Возврат;
	КонецЕсли;
	
	РезультатПакетногоЗапроса = ПолучитьПакетЗапросаЗначенийДляОтборов();	
	
	// Отбор внешняя система.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивВнешнихСистем");	
	ОбновитьДинамическоеМенюФильтрации_ВнешняяСистема(РезультатПакетногоЗапроса[0].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивВнешнихСистем_ВариантОтбора"), ПараметрыОтбора.МассивВнешнихСистем_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ВнешняяСистема", ПараметрыОтбора.МассивВнешнихСистем, Истина,,,ВариантОтбора);		
	КонецЕсли;
	
	// Отбор оператор.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивОператоров");	
	ОбновитьДинамическоеМенюФильтрации_Оператор(РезультатПакетногоЗапроса[1].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивОператоров_ВариантОтбора"), ПараметрыОтбора.МассивОператоров_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Оператор", ПараметрыОтбора.МассивОператоров, Истина,,,ВариантОтбора);		
	КонецЕсли;
	
	// Отбор статус.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивСтатусов");	
	ОбновитьДинамическоеМенюФильтрации_Статус(СтатусыДиалогов(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивСтатусов_ВариантОтбора"), ПараметрыОтбора.МассивСтатусов_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Статус", ПараметрыОтбора.МассивСтатусов, Истина,,,ВариантОтбора);		
	КонецЕсли;
	
	Если ОбновитьСписок Тогда 
		АктуализироватьДанныеСпискаСогласноОтборов();	
	КонецЕсли; 	
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Функция, возвращает массив статусов диалогов.
//
Функция СтатусыДиалогов()
	
	СтатусыДиалогов = Новый Массив;
	СтатусыДиалогов.Добавить("Диалог завершен");
	СтатусыДиалогов.Добавить("Оператор ответил");
	СтатусыДиалогов.Добавить("Ожидает ответа");
	
	Возврат СтатусыДиалогов;
	
КонецФункции

&НаСервере
// Процедура, инициализировать фильтр статус.
//
// Параметры:
//  ДанныеПериода			 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_ВнешняяСистема(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию	
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра	
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Внешняя система'; en = 'External system'"));	
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_ВнешняяСистема");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_ВнешняяСистема");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_ВнешняяСистема");	
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_ВнешняяСистема");	
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_ВнешняяСистема");	
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.ВнешниеСистемы"));
	
	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)	
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений);
	
	// Обновляем элементы фильтрации для текущего фильтра	
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																														
	
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр статус.
//
// Параметры:
//  ДанныеПериода			 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_Оператор(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию	
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра	
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Оператор'; en = 'Operator'"));	
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_Оператор");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_Оператор");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_Оператор");	
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_Оператор");	
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_Оператор");	
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	
	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)	
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений, Справочники.Сотрудники.ПустаяСсылка(), НСтр("ru = '<не назначен>'; en = '<not specified>'"));
	
	// Обновляем элементы фильтрации для текущего фильтра	
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																														
	
КонецПроцедуры

&НаСервере
// Процедура, инициализировать фильтр статус.
//
// Параметры:
//  ДанныеПериода			 - 	 - 
//  ОбновитьЭлементыЗначений - 	 - 
//
Процедура ОбновитьДинамическоеМенюФильтрации_Статус(КоллекцияЗначений = Неопределено, ОбновитьЭлементыЗначений = Ложь)
	
	// Инициализируем структуру параметров фильтра по умолчанию	
	СтруктураФильтра = УправлениеИнтерфейсамиСервер.ПолучитьСтруктуруФильтра();
	
	// Инициализируем параметры текущего фильтра	
	СтруктураФильтра.Вставить("Представление"							, НСтр("ru = 'Статус диалога'; en = 'Dialog status'"));	
	СтруктураФильтра.Вставить("Наименование"							, "Фильтр_Статус");
	СтруктураФильтра.Вставить("ИмяГруппыТипФильтра"						, "Фильтр_Статус");
	СтруктураФильтра.Вставить("ИмяСтраницыЗначенийФильтра"				, "Страница_Значения_Фильтр_Статус");	
	СтруктураФильтра.Вставить("ИмяГруппыЗначенийФильтра"				, "Значения_Фильтр_Статус");	
	СтруктураФильтра.Вставить("ИмяГруппыАктивированныхЗначенийФильтра"	, "АктивированныеЗначения_Фильтр_Статус");	
	СтруктураФильтра.Вставить("ОбновитьЭлементыЗначений"				, ОбновитьЭлементыЗначений);
	СтруктураФильтра.Вставить("ОписаниеТипаЗначения"					, Новый ОписаниеТипов("Строка"));
	
	// Инициализируем список значений для фильтрации (если не передаем коллекцию значений или передаем большую - будет автоматически установлен флаг "ТолькоПолеВыбора" в истину)	
	УправлениеИнтерфейсамиСервер.ИнициализироватьСписокЗначений(СтруктураФильтра, КоллекцияЗначений);
	
	// Обновляем элементы фильтрации для текущего фильтра	
	УправлениеИнтерфейсамиСервер.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, СтруктураФильтра);																														
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить значения фильтрации данных.
//
// Параметры:
//  ПараметрыОтбора				 - 	 - 
//  ОчиститьВсеФильтры			 - 	 - 
//  МассивИменОчищаемыхФильтров	 - 	 - 
//
Процедура ОбновитьЗначенияФильтрацииДанных(ПараметрыОтбора, ОчиститьВсеФильтры = Истина, МассивИменОчищаемыхФильтров = Неопределено)
	
	Если ОчиститьВсеФильтры Тогда 
		МассивИменОчищаемыхФильтров = Новый Массив();
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_ВнешняяСистема");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_Оператор");
		МассивИменОчищаемыхФильтров.Добавить("Фильтр_Статус");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МассивИменОчищаемыхФильтров) Тогда 
		УправлениеИнтерфейсамиСервер.ДеактивироватьВсеЗначенияФильтрацииДанных(ЭтаФорма, МассивИменОчищаемыхФильтров);
	КонецЕсли;
	
	// Отбор внешняя система.
	Если ПараметрыОтбора.Свойство("МассивВнешнихСистем") Тогда
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ВнешняяСистема", ПараметрыОтбора.МассивВнешнихСистем);
	КонецЕсли;
	
	// Отбор оператор.
	Если ПараметрыОтбора.Свойство("МассивОператоров") Тогда 	
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Оператор", ПараметрыОтбора.МассивОператоров);
	КонецЕсли;
	
	// Отбор статус.
	Если ПараметрыОтбора.Свойство("МассивСтатусов") Тогда 	
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Статус", ПараметрыОтбора.МассивСтатусов);
	КонецЕсли;
	
	АктуализироватьДанныеСпискаСогласноОтборов();
	
КонецПроцедуры

&НаСервере
// Процедура, актуализировать данные списка согласно отборов.
//
Процедура АктуализироватьДанныеСпискаСогласноОтборов()
	
	СтруктураОтборов 				= ПолучитьСтруктуруЗначенийОтбора();
	ЗапросДляДинамическогоСписка 	= ПолучитьЗапросДляДинамическогоСписка(СтруктураОтборов);
	
	// Цепляем наш запрос динамическому списку
	СписокЧатов.ТекстЗапроса = ЗапросДляДинамическогоСписка.Текст;
	
	// Устанавливаем параметры динамическому списку
	Для Каждого ПараметрЗапроса Из ЗапросДляДинамическогоСписка.Параметры Цикл 
		СписокЧатов.Параметры.УстановитьЗначениеПараметра(ПараметрЗапроса.Ключ, ПараметрЗапроса.Значение);		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Функция, возвращает структуру отборов формы.
//
Функция ПолучитьСтруктуруЗначенийОтбора()
	
	// Метод "ПолучитьЗначенияФильтра" возвращает список активированных значений фильтра.
	// У полученного списка значений есть свойство "ДоступныеЗначения", в котором хранится список всех значений.
	// Таким образом мы одним методом за одну итерацию получаем 2 списка значений(с активированными значениями и всеми значениями).
	// Вариант отбора передается в свойстве "ДоступныеЗначения" в представлении у любого элемента списка.
	
	СтруктураОтборов = Новый Структура();
	СтруктураОтборов.Вставить("ОтборВнешняяСистема"	, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_ВнешняяСистема"));
	СтруктураОтборов.Вставить("ОтборОператор"		, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Оператор"));
	СтруктураОтборов.Вставить("ОтборСтатус"			, УправлениеИнтерфейсамиСервер.ПолучитьЗначенияФильтра(ЭтаФорма.ТаблицаФильтров, "Фильтр_Статус"));
	
	Возврат СтруктураОтборов;
	
КонецФункции	

&НаСервере
// Функция, возвращает запрос с установленными параметрами, для списка формы.
//
Функция ПолучитьЗапросДляДинамическогоСписка(СтруктураОтборов)
	
	// текст запроса без отборов (чистый)
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= 	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Диалоги.ВнешняяСистема КАК ВнешняяСистема,
	|	Диалоги.ИдКлиента КАК Идентификатор,
	|	Диалоги.ИдДиалога КАК ИдДиалога,
	|	КонтактыМессенджеров.ОбъектИдентификации КАК ОбъектИдентификации,
	|	Диалоги.Оператор КАК Оператор,
	|	Диалоги.Начало КАК Начало,
	|	Диалоги.Окончание КАК Окончание,
	|	Диалоги.ПоследнееСообщениеОтКлиента КАК ПоследнееСообщениеОтКлиента,
	|	Диалоги.ИнициированКлиентом КАК ИнициированКлиентом,
	|	РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), Диалоги.ВремяДоПервогоОтвета, СЕКУНДА) КАК ВремяДоПервогоОтвета,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(30)) КАК ВремяДоПервогоОтветаПредставление,
	|	Диалоги.ДатаПоследнегоСообщения КАК ДатаПоследнегоСообщения,
	|	Диалоги.КоличествоСообщений КАК КоличествоСообщений,
	|	ВЫБОР
	|		КОГДА ГОД(Диалоги.ОбщееВремяОтветов) > 10
	|			ТОГДА 999999999
	|		ИНАЧЕ РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), Диалоги.ОбщееВремяОтветов, СЕКУНДА)
	|	КОНЕЦ КАК ОбщееВремяОтветов,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(30)) КАК ОбщееВремяОтветовПредставление,
	|	ВЫБОР
	|		КОГДА ГОД(Диалоги.МаксимальноеВремяОтвета) > 10
	|			ТОГДА 999999999
	|		ИНАЧЕ РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), Диалоги.МаксимальноеВремяОтвета, СЕКУНДА)
	|	КОНЕЦ КАК МаксимальноеВремяОтвета,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(30)) КАК МаксимальноеВремяОтветаПредставление,
	|	ВЫБОР
	|		КОГДА Диалоги.Окончание <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ""Диалог завершен""
	|		КОГДА Диалоги.ПоследнееСообщениеОтКлиента
	|			ТОГДА ""Ожидает ответа""
	|		ИНАЧЕ ""Оператор ответил""
	|	КОНЕЦ КАК Статус,
	|	ВЫБОР
	|		КОГДА Диалоги.КоличествоОтветов = 0
	|			ТОГДА 0
	|		КОГДА ГОД(Диалоги.ОбщееВремяОтветов) > 10
	|			ТОГДА 999999999
	|		ИНАЧЕ РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), Диалоги.ОбщееВремяОтветов, СЕКУНДА) / Диалоги.КоличествоОтветов
	|	КОНЕЦ КАК СреднееВремяОтвета,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(30)) КАК СреднееВремяОтветаПредставление,
	|	ВЫБОР
	|		КОГДА Диалоги.ДатаПоследнегоСообщения <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА РАЗНОСТЬДАТ(Диалоги.Начало, Диалоги.ДатаПоследнегоСообщения, СЕКУНДА)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДлительностьДиалога,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(30)) КАК ДлительностьДиалогаПредставление,
	|	ВЫБОР
	|		КОГДА Диалоги.ВнешняяСистема.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.GreenApi)
	|			ТОГДА 0
	|		КОГДА Диалоги.ВнешняяСистема.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.VkontakteApi)
	|			ТОГДА 1
	|		КОГДА Диалоги.ВнешняяСистема.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.telegram)
	|			ТОГДА 2
	|		КОГДА Диалоги.ВнешняяСистема.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.viber)
	|			ТОГДА 3
	|	КОНЕЦ КАК ИндексКартинкиМессенджера,
	|	КонтрагентыСведенияДляСписка.ТекущаяСделка КАК Сделка,
	|	КонтрагентыСведенияДляСписка.ТекущийЭтапСделки КАК ЭтапСделки,
	|	КонтрагентыСведенияДляСписка.ТекущийЭтапСделки.ВидСделки КАК ВидСделки,
	|	КонтрагентыСведенияДляСписка.ТекущийЭтапСделки.ЦветЭтапа КАК ЦветЭтапа
	|ИЗ
	|	РегистрСведений.Диалоги КАК Диалоги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактыМессенджеров КАК КонтактыМессенджеров
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтрагентыСведенияДляСписка КАК КонтрагентыСведенияДляСписка
	|			ПО (КонтактыМессенджеров.ОбъектИдентификации ССЫЛКА Справочник.Контрагенты)
	|				И ((ВЫРАЗИТЬ(КонтактыМессенджеров.ОбъектИдентификации КАК Справочник.Контрагенты)) = КонтрагентыСведенияДляСписка.Контрагент)
	|		ПО (КонтактыМессенджеров.Идентификатор = Диалоги.ИдКлиента)
	|			И (КонтактыМессенджеров.ВнешняяСистема = Диалоги.ВнешняяСистема)
	|ГДЕ
	|	Диалоги.КоличествоСообщений > 0
	|	И &УсловиеВнешняяСистема
	|	И &УсловиеОператор
	|	И &УсловиеСтатус";				  
	
	// Отбор внешняя система.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборВнешняяСистема) Тогда
		УсловиеВнешняяСистема = СтруктураОтборов.ОтборВнешняяСистема.ДоступныеЗначения[0].Представление + "Диалоги.ВнешняяСистема В (&ОтборВнешняяСистема)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеВнешняяСистема", УсловиеВнешняяСистема);
		Запрос.УстановитьПараметр("ОтборВнешняяСистема", СтруктураОтборов.ОтборВнешняяСистема.ВыгрузитьЗначения());
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеВнешняяСистема", "ИСТИНА");
	КонецЕсли;
	
	// Отбор внешняя система.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборОператор) Тогда
		УсловиеОператор = СтруктураОтборов.ОтборОператор.ДоступныеЗначения[0].Представление + "Диалоги.Оператор В (&ОтборОператор)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОператор", УсловиеОператор);
		Запрос.УстановитьПараметр("ОтборОператор", СтруктураОтборов.ОтборОператор.ВыгрузитьЗначения());
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОператор", "ИСТИНА");
	КонецЕсли;
	
	// Отбор внешняя система.
	Если ЗначениеЗаполнено(СтруктураОтборов.ОтборСтатус) Тогда
		УсловиеСтатус = СтруктураОтборов.ОтборСтатус.ДоступныеЗначения[0].Представление +
		"	ВЫБОР
		|		КОГДА Диалоги.Окончание <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ""Диалог завершен""
		|		КОГДА Диалоги.ПоследнееСообщениеОтКлиента
		|			ТОГДА ""Ожидает ответа""
		|		ИНАЧЕ ""Оператор ответил""
		|	КОНЕЦ В (&ОтборСтатус)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтатус", УсловиеСтатус);
		Запрос.УстановитьПараметр("ОтборСтатус", СтруктураОтборов.ОтборСтатус.ВыгрузитьЗначения());
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтатус", "ИСТИНА");
	КонецЕсли;
	
	Возврат Запрос;
	
КонецФункции	

&НаСервереБезКонтекста
// Функция, возвращает пакет запроса с элементами для создания отборов.
//
Функция ПолучитьПакетЗапросаЗначенийДляОтборов()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВнешниеСистемы.Ссылка КАК Ссылка,
	|	ВнешниеСистемы.Представление КАК Представление
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	ВнешниеСистемы.Используется
	|	И НЕ ВнешниеСистемы.ПометкаУдаления
	|	И ВнешниеСистемы.ТипВнешнейСистемы В(&ТипыВнешнихСистем)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АктивныеПользователиМессенджер.Пользователь.Ссылка КАК Ссылка,
	|	АктивныеПользователиМессенджер.Пользователь.Представление КАК Представление
	|ИЗ
	|	РегистрСведений.АктивныеПользователиМессенджер КАК АктивныеПользователиМессенджер
	|ГДЕ
	|	НЕ АктивныеПользователиМессенджер.Пользователь.ПометкаУдаления
	|	И АктивныеПользователиМессенджер.Пользователь <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)");
	
	Запрос.УстановитьПараметр("ТипыВнешнихСистем", Справочники.ВнешниеСистемы.ПолучитьМассивТиповВнешнихСистемМессенджера());
	
	Возврат Запрос.ВыполнитьПакет();
	        	
КонецФункции

#КонецОбласти

#Область ОбработчикиМеханизмаФильтрации

&НаСервере
// Процедура - Применить механизм фильтрации данных.
//
// Параметры:
//  ДанныеЭлементаФильтрации - 	 - 
//
Процедура ПрименитьМеханизмФильтрацииДанных(ДанныеЭлементаФильтрации) Экспорт
	
	МассивСтрокОбрабатываемыхФильтров = ТаблицаФильтров.НайтиСтроки(Новый Структура("Применен", Ложь));
	Для Каждого СтрокаФильтра ИЗ МассивСтрокОбрабатываемыхФильтров Цикл
		УправлениеИнтерфейсамиСервер.ОбновитьГруппуАктивированныхЗначенийФильтра(ЭтаФорма, СтрокаФильтра);
	КонецЦикла;
	
	АктуализироватьДанныеСпискаСогласноОтборов();	
	ЭтаФорма.ТекущийЭлемент = Элементы.СписокЧатов;
		
КонецПроцедуры

&НаКлиенте
// Процедура - Обработчик нажатия элемента фильтрации данных.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ОбработчикНажатияЭлементаФильтрацииДанных(Команда, ВыбранноеЗначение, СтандартнаяОбработка) Экспорт
	
	МассивИмен = СтрРазделить(Команда.Имя,"_");
	
	Если МассивИмен.Количество() <> 0 Тогда 
		
		Если МассивИмен[0] = "Удалить" Тогда
			
			РезультатОбновления = УправлениеИнтерфейсамиКлиент.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, Команда.Имя, , ВыбранноеЗначение);
			Если РезультатОбновления.Свойство("ДействиеЭлемента") И РезультатОбновления.ДействиеЭлемента = "ОбработкаВыбора" Тогда 
				Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда 
					СтандартнаяОбработка = Ложь;
					//ВыбранноеЗначение = Неопределено;
					//ЭлементФормы.ОбновитьТекстРедактирования(); 			
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Отбор"				, ПараметрыВыбранныхФильтров(Новый Структура));
			ПараметрыФормы.Вставить("ИмяКоманды"		, Команда.Имя);
			ПараметрыФормы.Вставить("ВыбранноеЗначение" , ВыбранноеЗначение);
			
			ОткрытьФорму("РегистрСведений.Диалоги.Форма.ФормаФильтры",
						 ПараметрыФормы,,,,,
						 Новый ОписаниеОповещения("ОткрытиеФильтровЗавершение", ЭтотОбъект),
						 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция - получение сведений о выбранных фильтрах.
//
Функция ПараметрыВыбранныхФильтров(ПараметрыОтбора)
	
	Для каждого Строка из ТаблицаФильтров Цикл
		Если Строка.КоличествоАктивированныхЗначений > 0 Тогда
			
			МассивДанных = ПолучениеЭлементовОтбора(Новый Массив, Строка.СписокЗначений, Строка.Наименование);
			
			Если Строка.Наименование = "Фильтр_ВнешняяСистема" Тогда
				ПараметрыОтбора.Вставить("МассивВнешнихСистем"				, МассивДанных);
				ПараметрыОтбора.Вставить("МассивВнешнихСистем_ВариантОтбора", Строка.ВариантОтбора);

			ИначеЕсли Строка.Наименование = "Фильтр_Оператор" Тогда
				ПараметрыОтбора.Вставить("МассивОператоров"			   , МассивДанных);
				ПараметрыОтбора.Вставить("МассивОператоров_ВариантОтбора", Строка.ВариантОтбора);
				
			ИначеЕсли Строка.Наименование = "Фильтр_Статус" Тогда
				ПараметрыОтбора.Вставить("МассивСтатусов"			   , МассивДанных);
				ПараметрыОтбора.Вставить("МассивСтатусов_ВариантОтбора", Строка.ВариантОтбора);
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(ПараметрыОтбора, Новый УникальныйИдентификатор);
	
КонецФункции

&НаСервереБезКонтекста
// Функция - ПолучениеЭлементовОтбора
Функция ПолучениеЭлементовОтбора(Массив, СписокЗначений, НаименованиеФильтра)
	
	Если НаименованиеФильтра = "Фильтр_СозданаПериод" 
		ИЛИ НаименованиеФильтра = "Фильтр_ЗавершенаПериод" 
		ИЛИ НаименованиеФильтра = "Фильтр_ПериодЗапланированнойЗадачи" Тогда
		
		Если СписокЗначений.Количество() > 0 Тогда
			ЗаданноеЗначение = СписокЗначений.Получить(0).Значение; 
			Массив.Добавить(ЗаданноеЗначение.ЗначениеФильтра);
		КонецЕсли;
		
	Иначе
		
		Если СписокЗначений.Количество() > 0 Тогда
			Для каждого Значение из СписокЗначений Цикл
				Если Значение.Значение.Выбран = Истина Тогда
					Массив.Добавить(Значение.Значение.ЗначениеФильтра);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Массив;
	
КонецФункции

&НаКлиенте
// Процедура - ОткрытиеФильтровЗавершение.
//
Процедура ОткрытиеФильтровЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ОткрытиеФильтровНаСервере(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - ОткрытиеФильтровНаСервере.
//
Процедура ОткрытиеФильтровНаСервере(Результат)
	
	ПараметрыОтбора = ПолучитьИзВременногоХранилища(Результат);
	ОбновитьМеханизмФильтрацииДанных(ПараметрыОтбора, Истина);	
	
КонецПроцедуры

&НаСервере
// Процедура - Инициализировать механизм фильтрации данных
//
// Параметры:
//  ПараметрыОтбора	 - 	 - 
//  ОбновитьСписок	 - 	 - 
//
Процедура ОбновитьМеханизмФильтрацииДанных(ПараметрыОтбора = Неопределено, ОчиститьФильтры = Ложь)
	
	Для Каждого Строка из ТаблицаФильтров Цикл
		Строка.Инициализирован = Ложь;
	КонецЦикла;
	
	МассивИменОчищаемыхФильтров = Новый Массив();
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_ВнешняяСистема");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_Оператор");
	МассивИменОчищаемыхФильтров.Добавить("Фильтр_Статус");
	
	УправлениеИнтерфейсамиСервер.ДеактивироватьВсеЗначенияФильтрацииДанных(ЭтаФорма, МассивИменОчищаемыхФильтров);

	РезультатПакетногоЗапроса = ПолучитьПакетЗапросаЗначенийДляОтборов();	
	
	// Отбор внешняя система.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивВнешнихСистем");	
	ОбновитьДинамическоеМенюФильтрации_ВнешняяСистема(РезультатПакетногоЗапроса[0].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивВнешнихСистем_ВариантОтбора"), ПараметрыОтбора.МассивВнешнихСистем_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_ВнешняяСистема", ПараметрыОтбора.МассивВнешнихСистем, Истина,,, ВариантОтбора);		
	КонецЕсли;
	
	// Отбор оператор.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивОператоров");	
	ОбновитьДинамическоеМенюФильтрации_Оператор(РезультатПакетногоЗапроса[1].Выгрузить(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивОператоров_ВариантОтбора"), ПараметрыОтбора.МассивОператоров_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Оператор", ПараметрыОтбора.МассивОператоров, Истина,,, ВариантОтбора);		
	КонецЕсли;
	
	// Отбор статус.
	УстановитьОтбор = ПараметрыОтбора <> Неопределено И ПараметрыОтбора.Свойство("МассивСтатусов");	
	ОбновитьДинамическоеМенюФильтрации_Статус(СтатусыДиалогов(), УстановитьОтбор);
	Если УстановитьОтбор Тогда
		ВариантОтбора = ?(ПараметрыОтбора.Свойство("МассивСтатусов_ВариантОтбора"), ПараметрыОтбора.МассивСтатусов_ВариантОтбора, Истина);
		УправлениеИнтерфейсамиСервер.УстановитьЗначенияФильтрацииДанных(ЭтаФорма, "Фильтр_Статус", ПараметрыОтбора.МассивСтатусов, Истина,,, ВариантОтбора);		
	КонецЕсли;
	
	АктуализироватьДанныеСпискаСогласноОтборов();
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить свойства разделов фильтра.
//
// Параметры:
//  АктуализироватьФлаги - 	 - 
//
Процедура ОбновитьСвойстваРазделовФильтра(АктуализироватьФлаги = Ложь, ИмяСтраницыЗначенийФильтра = Неопределено) Экспорт
	
	Если ИмяСтраницыЗначенийФильтра <> Неопределено Тогда 
		Элементы.СтраницыЗначенийФильтров.ТекущаяСтраница = Элементы[ИмяСтраницыЗначенийФильтра];
	КонецЕсли;		
	УправлениеИнтерфейсамиСервер.ОбновитьСвойстваРазделовФильтра(ЭтаФорма, АктуализироватьФлаги);
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить группу значений фильтра.
//
// Параметры:
//  ИдентификаторСтрокиФильтра	 - 	 - 
//
Процедура ОбновитьГруппуЗначенийФильтра(ИдентификаторСтрокиФильтра, ИнициализироватьВыбранноеЗначение = Ложь, ВыбранноеЗначение = Неопределено) Экспорт
	
	СтрокаФильтра = ТаблицаФильтров.НайтиПоИдентификатору(ИдентификаторСтрокиФильтра);
	УправлениеИнтерфейсамиСервер.ОбновитьГруппуЗначенийФильтра(ЭтаФорма, СтрокаФильтра, ИнициализироватьВыбранноеЗначение, ВыбранноеЗначение);
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить свойства элемента значения.
//
// Параметры:
//  ДанныеЭлементаФильтрации - 	 - 
//
Процедура ОбновитьСвойстваЭлементаЗначения(ДанныеЭлементаФильтрации) Экспорт
	
	УправлениеИнтерфейсамиСервер.ОбновитьСвойстваЭлементаЗначения(ЭтаФорма, , , ДанныеЭлементаФильтрации);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выбор стандартного периода.
//
// Параметры:
//  РезультатВыбора			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ВыборСтандартногоПериода(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если НЕ РезультатВыбора = Неопределено И НЕ ДополнительныеПараметры = Неопределено Тогда
		ЭлементВариантСтандартногоПериода = ЭтаФорма[ДополнительныеПараметры.ИмяТаблицы].НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторФильтра).СписокЗначений[0].Значение.СписокСтандартныхПериодов.НайтиПоЗначению(РезультатВыбора.Значение);
		Если НЕ ЭлементВариантСтандартногоПериода = Неопределено Тогда
			ДополнительныеПараметры.Вставить("ИдентификаторЗначения", ЭлементВариантСтандартногоПериода.ПолучитьИдентификатор());
			ЭтаФорма[ДополнительныеПараметры.ИмяТаблицы].НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторФильтра).СписокЗначений[0].Значение.СписокСтандартныхПериодов.ЗаполнитьПометки(Ложь);
			ЭлементВариантСтандартногоПериода.Пометка = Истина;
			РезультатОбновления = УправлениеИнтерфейсамиКлиент.ОбновитьЭлементыФильтрацииДанных(ЭтаФорма, "УстановитьСтандартныйПериод_ЗначениеФильтра_Идентификатор_" + ДополнительныеПараметры.ИдентификаторФильтра, ДополнительныеПараметры);
		КонецЕсли;	
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#КонецОбласти

&НаСервереБезКонтекста
// Функция, возвращает представление времени.
//
Функция ПолучитьПредставлениеВремениДляСписка(КоличествоСекунд)
	
	ПредставлениеВремени = "";
	
	Если Не ЗначениеЗаполнено(КоличествоСекунд) Тогда
		Возврат ПредставлениеВремени;
	КонецЕсли;
	
	Часы	 = Цел(КоличествоСекунд / 3600);
	Минуты	 = Цел((КоличествоСекунд % 3600) / 60);
	Секунды	 = Цел(КоличествоСекунд % 60);
	
	ОтображатьСекунды = (Часы = 0 И Минуты = 0);
	
	ПредставлениеВремени = 
	?(Часы = 0, "", "" + Часы + НСтр("ru = ' ч. '; en = ' h. '")) +
	?(Минуты = 0, "", "" + Минуты + НСтр("ru = ' мин. '; en = ' min. '")) +
	?(ОтображатьСекунды, "" + Секунды + НСтр("ru = ' сек.'; en = ' sec.'"), "");
	
	Возврат ПредставлениеВремени;
	
КонецФункции

&НаСервере
// Процедура, создает элементы условного оформления для сделок.
//
Процедура УстановитьУсловноеОформлениеСделок()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(ЭтапыСделок.ЦветЭтапа КАК СТРОКА(100)) КАК ЦветЭтапа
	|ИЗ
	|	Справочник.ЭтапыСделок КАК ЭтапыСделок
	|ГДЕ
	|	НЕ (ВЫРАЗИТЬ(ЭтапыСделок.ЦветЭтапа КАК СТРОКА(100))) = """"";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЭлементУсловногоОформления = ЭтотОбъект.СписокЧатов.УсловноеОформление.Элементы.Добавить();
		
		ЭлементОтбора				 = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЦветЭтапа");
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Выборка.ЦветЭтапа;
		ЭлементОтбора.Использование  = Истина;
		
		ЦветЭтапа = ЗначениеИзСтрокиВнутр(Выборка.ЦветЭтапа);
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветЭтапа);
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ПолучитьЦветТекстаПоФону(ЦветЭтапа));
		
		ПолеОформления				 = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле 		 = Новый ПолеКомпоновкиДанных("ЭтапСделки");
		ПолеОформления.Использование = Истина;
		
	КонецЦикла;
	
	// Условное оформление для успеха.
	ЭлементУсловногоОформления = СписокЧатов.УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора				 = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЭтапСделки");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Справочники.ЭтапыСделок.Успех;
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона"  , Новый Цвет(72, 193, 123));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(255, 255, 255));
	
	ПолеОформления				 = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле 		 = Новый ПолеКомпоновкиДанных("ЭтапСделки");
	ПолеОформления.Использование = Истина;
	
	// Условное оформление для отказа.
	ЭлементУсловногоОформления = СписокЧатов.УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора				 = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЭтапСделки");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Справочники.ЭтапыСделок.Отказ;
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона"  , Новый Цвет(246, 110, 110));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста",(Новый Цвет(255, 255, 255)));
	
	ПолеОформления				 = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле 		 = Новый ПолеКомпоновкиДанных("ЭтапСделки");
	ПолеОформления.Использование = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, возвращает цвет текста для переданного цвета фона.
//
Функция ПолучитьЦветТекстаПоФону(ЦветФона)
	
	Если (ЦветФона.Зеленый + ЦветФона.Красный + ЦветФона.Синий) > 383 Тогда
		Возврат Новый Цвет(60,60,60);		
	Иначе
		Возврат Новый Цвет(255,255,255);
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает идентификатор ожидающего сообщения.
//
Функция ПолучитьИдОжидающегоСообщения(Идентификатор, ВнешняяСистема)
	
	Возврат МессенджерСтоматология.ПолучитьИдОжидающегоСообщенияВМесенджер(Идентификатор, ВнешняяСистема);
	
КонецФункции

#КонецОбласти
